package meetanimal

import (
	"fmt"
	"math/rand"
	"quizz/wakeup"
)

func Meetanimal(c wakeup.Character) {
	fmt.Printf("У лісі %s натикається на мертве тіло дивної тварини. \n Що робити  з твариною❓❓❓⌨ \n 1️⃣ Щоб оглянути тварину натисніть 1 на клавуатурі\n 2️⃣ Щоб просто уйти та уникнути неприємностей натисніть 2 \n 3️⃣ Щоб розбудити тварину натисніть 3 \n 4️⃣ Натисніть будь яку іншу клавішу щоб дати персонажу виріщити що робити \n", c.Name)
	var choice int

	fmt.Scanln(&choice)

	switch choice {
	case 1:
		fmt.Printf("%s підходить до тіла та оглядає його. Він помічає дивний символ на шиї тварини, але нічого більше не помічає.\n", c.Name)

	case 2:
		fmt.Printf("%s обходить тіло, уникаючи зайвих неприємностей.\n", c.Name)
	case 3:
		fmt.Printf("%s спробував роздратувати тіло, але воно ні на що не реагує.\n", c.Name)
	default:

		choice := rand.Intn(3) + 1
		switch choice {
		case 1:
			fmt.Printf("%s підходить до тіла та оглядає його. Він помічає дивний символ на шиї тварини, але нічого більше не помічає.\n", c.Name)

		case 2:
			fmt.Printf("%s обходить тіло, уникаючи зайвих неприємностей.\n", c.Name)
		case 3:
			fmt.Printf("%s спробував роздратувати тіло, але воно ні на що не реагує.\n", c.Name)

		}
	}
}
